months_in_year = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']

days_of_week = ['Mon', 'Tue', 'Wed', 'Thu', 'Fri', 'Sat', 'Sun']

# Зверніть увагу, як у рядку 6 ми розрізаємо список,
# який ми зациклюємо, замість того, щоб циклічно переглядати весь список місяців.
for month in months_in_year[0:6]:  # На кожен місяць у перші півроку ...
	print("\n")
	print(month)
	print("\n")

	for week in range(1, 5):
		print("Week {0}".format(week))

		# Зверніть увагу, що ми знову нарізаємо в рядку 15, а не циклічно протягом усього тижня.
		for day in days_of_week[-2:]:  # За останні два дні тижня (субота та неділя)
				print(day)

# Прибравши нарізку з рядків 6 і 15, отримуємо повний рік (або хоча б 12 місяців при 4 тижнях по 7 днів)
