address = "1600 Pennsylvania Ave NW Washington, DC"

# .split() — метод string (функція, яка працює тільки з рядками),
# який розбиває рядок на список на основі деякого роздільника.
# У цьому прикладі ми розділяємо адресу на список у кожному просторі.
address = address.split(" ")

# Адреса тепер дорівнює списку:
# ['1600', 'Pennsylvania', 'Ave', 'NW', 'Washington,', 'DC']
# Зверніть увагу, що створений список є списком рядків.

# А оскільки це список, ви можете зациклитися на ньому!

# .split() зазвичай використовується для розділення текстових файлів на список (у кожному новому рядку)
# .split() також зазвичай використовується для розділення файлів електронних таблиць у форматі CSV,
# розділених комами (CSV), на список (біля кожної коми)

# Кожного разу, коли вам потрібно розділити рядок на кілька частин, ви можете використовувати .split()
