# Якщо ви новачок в обробці файлів, обов'язково перевірте with_open.py спочатку!
# Ви також захочете ознайомитися з read_text.py перед цим прикладом.  Цей трохи більш просунутий.

with open('read_csv.csv', 'r') as states_file:
    
    # Замість того, щоб залишати вміст файлу як рядок, ми розбиваємо файл на список у кожному новому рядку
    # та зберігаємо цей список у станах змінних
    states = states_file.read().split("\n")
    
    # Оскільки це електронна таблиця у форматі значень, розділених комами (CSV), ми можемо розглядати стани як список рядків.
    # Але нам також потрібно буде розділити стовпці на список!

    for index, state in enumerate(states):
        states[index] = state.split(",")

# Тепер у нас є вкладений список з усією інформацією!

# Наш файл виглядає так:
# State, Population Estimate, Percent of Total population
# California, 38332521, 11.91%
# Texas, 26448193, 8.04%
# ...

# Наш рядок заголовка знаходиться на state[0],
# тому ми можемо використовувати його для гарнішого відображення інформації.
for state in states[1:]:  # Ми використовуємо [1:], тому пропускаємо рядок заголовка.

    # state[0] – це перший стовпець у рядку, який містить ім'я штату.
    print("\n---{0}---".format(state[0]))

    for index, info in enumerate(state[1:]):  # Ми використовуємо [1:], щоб не повторювати назву штату.
        print("{0}:\t{1}".format(states[0][index+1], info))

    # Штати - це повний список всіх штатів. Це вкладений список.
    # Зовнішній список містить рядки, кожен внутрішній список містить стовпці в цьому рядку.
    # states[0] посилається на рядок заголовка списку
    # Таким чином, штати[0][0] посилатимуться на «державу», штати[0][1] — на «оцінку чисельності населення»,
    # а штати[0][2] — на «відсоток від загальної чисельності населення»

    # Держава - це одна держава всередині держав. Штат також є списком, що містить назву,
    # населення та відсоток цього конкретного штату.
    # Таким чином, перший раз через цикл штат[0] посилався б на «Каліфорнію»,
    # штат[1] посилався б на 38332521, а штат[2] посилався б на 11,91%
    # Оскільки стан створюється циклом for у рядку 24, він щоразу отримує нове значення.

    # Ми використовуємо enumerate, щоб отримати індекс (номер фрагмента) стовпця,
    # на якому ми знаходимося, разом з інформацією.
    # Таким чином, ми можемо з'єднати назву стовпця з інформацією, як показано в рядку 30.
    # ПРИМІТКИ: Оскільки ми нарізаємо з [1:] у рядку 29, нам потрібно збільшити індекс на + 1,
    # інакше наші заголовки будуть вимкнені на одиницю.

# Приклад виводу:

# ---"California"---
# "Population Estimate":  38332521
# "Percent of Total population":  "11.91%"

# ---"Texas"---
# "Population Estimate":  26448193
# "Percent of Total population":  "8.04%"

# ---"New York"---
# "Population Estimate":  19651127
# "Percent of Total population":  "6.19%"
