# Якщо ви новачок в обробці файлів, обов'язково перевірте with_open.py спочатку!

with open('states.txt', 'r') as states_file:
    states = states_file.read().split("\n")

print(states)

# .read() це файловий метод, який читає файл (який файл? той, що знаходиться у файловому
# об'єкті безпосередньо перед крапкою) і повертає весь вміст у вигляді рядка.

# Замість того, щоб залишати його як рядок, ми розбиваємо файл на список
# у кожному новому рядку і зберігаємо цей список у станах змінних

# Тепер ми можемо зациклитися на цьому списку!

for state in states:
    print(state)
