# Якщо ви новачок у словниках, ви можете почати з dict_access.py

# Створюємо словник.
contacts = {
    'Shannon': '202-555-1234',
    'Amy': '410-515-3000',
    'Jen': '301-600-5555',
    'Julie': '202-333-9876'
}

# Якщо ми хочемо додати новий елемент до словника, ми можемо використовувати прямий доступ, щоб змінити його.
contacts['Rachel'] = '202-888-1234'

# Ми також можемо зробити те ж саме, щоб змінити існуючий словниковий елемент.
contacts['Amy'] = '703-444-8888'

# Це чудово підходить для зміни словника по одному ключу за раз, але, скажімо, у нас є багато оновлень.
# У нас є два варіанти.

new_contacts = {
    'Kristin': '703-333-1234',
    'Katie': '301-555-9876',
    'Grace': '202-777-2222',
    'Charlotte': '410-555-9999'
}

# Варіант 1: Циклічний перегляд змін по одному.

for name, phone in list(new_contacts.items()):
    contacts[name] = phone

# Тепер у контактах є все в new_contacts.
print(contacts, "\n")


# Давайте повернемо контакти до значення, яке вони мали до того, як ми додали new_contacts.
contacts = {
    'Shannon': '202-555-1234',
    'Amy': '410-515-3000',
    'Jen': '301-600-5555',
    'Julie': '202-333-9876',
    'Rachel': '202-888-1234'
}

# Варіант 2: Використовуйте словниковий метод .update()
contacts.update(new_contacts)

print(contacts)
