# Якщо ви новачок у словниках, ви можете почати з dict_access.py

# Створюємо словник.
contacts = {
    'Shannon': '202-555-1234',
    'Amy': '410-515-3000',
    'Jen': '301-600-5555',
    'Julie': '202-333-9876'
}

# Ми можемо використовувати метод словника .keys(), щоб дати нам список усіх ключів у контактах.
print(list(contacts.keys()))

for contact in list(contacts.keys()):
    print("{0}'s number is {1}".format(contact, contacts[contact]))

# Словники невпорядковані, тому ключі (та їхні значення) можуть бути в іншому порядку кожного разу.
# А можуть і ні.  У будь-якому випадку, це нормально.

# Іншими словами, ви не можете покладатися на впорядкування чого-небудь у словнику.
# Але ви можете застосувати замовлення до ключів.

# Вбудована функція sorted() відсортує список за зростанням.

for contact in sorted(contacts.keys()):
    print("{0}'s number is {1}".format(contact, contacts[contact]))
