schools = {
    "geometry": {
        "coordinates": [
            -81.50572799999999, 
            39.21675500000001
        ], 
        "type": "Point"
    }, 
    "properties": {
        "address": "300 Campus Drive, Parkersburg, WV 26104", 
        "marker-color": "#3F3040", 
        "marker-symbol": "circle", 
        "name": "West Virginia University at Parkersburg"
    }, 
    "type": "Feature"
}

# Приклад питання: Як ви могли «нарізати» словник для друку «Особливість» з рядка 15?
# Відповідь: друковані школи["тип"]

# Питання 1: Який фрагмент дасть вам словник
#   з ключем "координати" і значенням, що містить список
#   з пунктами -81.505727999999999 та 39.21675500000001?

# Питання 2: Який фрагмент дасть вам адресу школи?

# Питання 3: Який фрагмент дасть вам назву школи?

# Питання 4: Який шматочок дасть вам широту школи?
#   (Підказка: широта 39.216...)

# Питання 5 (бонус): Який зріз додасть вам маркер-колір
#   без хештегу спереду?
