# Це, мабуть, найкраще місце для початку зі словників.

# Спочатку давайте створимо рядок, список і словник.

name = "Shannon"

attendees = ['Shannon', 'Amy', 'Jen', 'Julie']

contacts = {
    'Shannon': '202-555-1234',
    'Amy': '410-515-3000',
    'Jen': '301-600-5555',
    'Julie': '202-333-9876'
}

# Ми можемо отримати доступ до частини рядка за допомогою нарізки:
print(name[0])  # S

# Ми можемо отримати доступ до частини списку за допомогою нарізки:
print(attendees[0:2])  # Shannon, Amy

# Ми можемо отримати доступ до частини словника, якщо знаємо його ключ.
print(contacts['Jen'])  # 301-600-5555

# У рядках 9-14 ми створили словник.
# Словники - це ще один спосіб зберігання інформації в Python.
# Словники складаються з пар ключ + значення.

# У контактах словника ключами є Шеннон, Емі, Джен і Джулі.
# Ключі словника — це рядки, які можна використовувати для перегляду вмісту.
# Значеннями словника можуть бути будь-які типи інформації - рядок, список, число, навіть словник!
# Те значення прив'язане до ключа - воно належить ключу.

# Кращий спосіб думати про словник - телефонна книга або список контактів.
# Наскільки складно було б, якби нам довелося зберігати такі контакти?

contacts_as_list = [
    ['Shannon', '202-555-1234'],
    ['Amy', '410-515-3000'],
    ['Jen', '301-600-5555'],
    ['Julie', '202-333-9876']
]

# Що, якби ми хотіли отримати номер телефону Джен? Було б боляче його отримати!
# Нам доведеться зациклити кожен елемент у списку та перевірити назву, наприклад:

phone_we_want = 'Jen'

for contact in contacts_as_list:
    if contact[0] == phone_we_want:
        print(contact[1]) # The phone number

# Вид болю.  На щастя, словники означають, що нам не потрібно цього робити!

print(contacts['Jen'])
