# Якщо ви новачок у словниках, ви можете почати з dict_access.py

# Створюємо словник.
contacts = {
    'Shannon': '202-555-1234',
    'Amy': '410-515-3000',
    'Jen': '301-600-5555',
    'Julie': '202-333-9876'
}

# Ми можемо використовувати метод словника .values(), щоб дати нам список усіх значень у контактах.
print(list(contacts.values()))

for phone in list(contacts.values()):
    print("{0}".format(phone))

# .values() використовується рідше, ніж .keys(), оскільки ви не можете отримати ключ зі значення
# (але ви можете отримати значення, якщо знаєте ключ)

# Використовуйте .values(), якщо вам байдуже, що це за ключ, вам просто потрібен список усіх значень.
# Це рідше, але все ж добре знати.
