# Перетворення словників (а також списків, рядків тощо) у JSON

# Для початку використовуйте вбудовану бібліотеку json.  Вам не потрібно встановлювати це, він поставляється з python.
import json

# Далі створіть свій словник.
contacts = [
    {
        'friends': [
            {'Shannon': {'phone': '202-555-1234', 'twitter': '@svt827', 'github': '@shannonturner'}},
            {'Amy': {'phone': '410-515-3000', 'fax': '410-555-3001', 'email': 'amy@amy.org'}},
            {'Jen': {'phone': '301-600-5555', 'email': 'jen@jen.biz'}},
            {'Julie': {'phone': '202-333-9876'}},
        ],
        'enemies': []
    }
]

# Контакти - це список, який містить словник з двома ключами: друзями і ворогами
#       Друзі - це список, який містить чотири словники
#           Shannon це один словник, і вона має словник для всіх способів зв'язку з нею
#           Amy це ще один словник, і у неї є словник для всіх способів зв'язку з нею
#           Jen це ще один словник, і у неї є словник для всіх способів зв'язку з нею
#           Julie це ще один словник, і у неї є словник для всіх способів зв'язку з нею
#       Вороги - це порожній список

# json.dumps() використовується для скидання інформації,
# що зберігається у вигляді словників, списків і рядків, у формат JSON
print(json.dumps(contacts, indent=4, sort_keys=True))
# indent=4 буде відступати кожен рівень як стільки пробілів (4), що виглядає набагато приємніше, ніж не робити цього.
# sort_keys=True відсортує ключі в словнику на основі їх назви

# Ви можете не побачити відступ, якщо друкуєте на терміналі;
# Можливо, вам доведеться записати вихідні дані у файл, щоб побачити його.
with open('contacts.json', 'w') as json_contacts:
    json_contacts.write(json.dumps(contacts, indent=4, sort_keys=True))
