# Форматування рядків

# Форматування рядків - це те, як ми можемо використовувати змінні
# (які зберігають інформацію, включаючи числа, рядки та інші типи даних) всередині рядків
# Ми можемо зробити це за допомогою рядкового методу .format().

# Ось як це працює:

# По-перше, нам знадобиться змінна:
name = "Shannon"

# Тепер давайте вставимо його в інструкцію для друку:
print("My name is {0}".format(name))  # Це надрукує "Мене звуть Шеннон"

# Ми розберемо кожну частину синтаксису за мить.  Наразі, чому це краще, ніж друк «Мене звуть Шеннон»?

# Використання .format() є більш гнучким і дозволяє вашим рядкам змінюватися при зміні змінних.

# Отже, давайте дамо змінній імені нове значення.
name = "Pumpkin"

# Тепер давайте надрукуємо його ще раз
print("My name is {0}".format(name))  # Це надрукує "Мене звуть Гарбуз"

# Пам'ятайте, що Python виконує команди зверху вниз, зліва направо.

# Двома новими частинами цієї інструкції для друку є {0} і .format(ім'я)

# {0} є заповнювачем для 0-ї змінної у списку, який з'являється в дужках .format() -- пам'ятайте,
# що Python починає відлік з 0, а не з 1
# Таким чином, він дійсно просто зберігає місце теплим.

# Щоб зрозуміти, чому це {0}, давайте визначимо ще кілька змінних.

age = 100
location = "The Pumpkin Patch"

# Тепер, якщо ми хочемо включити ці змінні, нам також потрібно буде помістити заповнювачі в рядок.
print("My name is {0} and my age is {1} and I live in {2}".format(name, age, location))

# Зверніть увагу, як ми поміщаємо заповнювачі саме в рядок, де ми хочемо; і змінні знаходяться всередині дужок .format()

# Запам'ятайте, як рахує Python.
# Отже, {0} є заповнювачем для імені;
# {1} є заповнювачем для віку;
# і {2} є заповнювачем для розташування

# Якби у нас було більше змінних, ми б продовжували так само.

# Але це можна зробити кількома способами:
print("My name is {name} and my age is {age} and I live in {location}".format(name=name, age=age, location=location))
# Цей спосіб відчувається більш явним

# Тут розглянуто лише деякі способи використання форматування рядків.
