"""
 Написати функцію read_file_contents, яка отримує шлях до файлу як аргумент.
   Функція повинна відкривати файл, читати його вміст і повертати вміст як рядок.
   У процесі реалізації ви повинні врахувати наступні сценарії обробки помилок:
    * Якщо файл не існує, ваша функція повинна ловити виключення, яке виникає при спробі відкриття неіснуючого файлу,
      і повертати повідомлення: "Помилка: файл не знайдено."
    * Якщо при читанні файлу виникає помилка, функція повинна повертати: "Помилка: не вдається прочитати файл."
    * У випадку будь-яких інших непередбачуваних виключень, поверніть: "Помилка: невідома помилка."
"""


