"""
 1) Створіть клас Book, який містить приватні атрибути для назви книги, автора, року видання та ISBN номеру.
    Ваш клас повинен мати методи, що дозволяють отримати цю інформацію, але не змінювати її після створення об'єкту.

 2) Створіть клас Reader, який містить ім'я, контактну інформацію та номер читацького квитка.
    Клас повинен мати методи для отримання цієї інформації.

 3) Створіть клас Catalog, який буде агрегувати об'єкти класу Book. Він повинен мати можливість додавати книги,
    видаляти книги за ISBN, шукати книгу за назвою або автором.

 4) Додайте клас Borrowing, який дозволяє читачам брати книги на певний термін. Клас повинен відстежувати,
    хто взяв книгу, яку книгу взяли, та коли книга повинна бути повернена.

 5) створіть кілька об'єктів для кожного класу і продемонструйте, як вони взаємодіють один з одним.

 6)  створити новий клас IllustratedBook, який наслідується від класу Book.
    Цей підклас призначений для книг з ілюстраціями. Він повинен мати додаткові атрибути, такі як illustrator
    (художник-ілюстратор) та illustrations_count (кількість ілюстрацій).
    Під час створення екземпляру IllustratedBook, необхідно використовувати методи батьківського класу
    для установки атрибутів, які спільні для всіх книг, а також додавати нові атрибути, що стосуються лише
    ілюстрованих книг. Також створіть методи, які дозволять користувачеві отримувати і
    нформацію про художника-ілюстратора та кількість ілюстрацій.

  7) Додайте метод __str__ у класі IllustratedBook, який перезаписує оригінальний метод в класі Book,
     додаючи до інформації про книгу дані про ілюстрації.

"""


