"""
1)
Є список
arr = [2, 3, 10, 2, 10, 3, 2, 30, 4, 6]
Треба вивести всі унікальні елементи,але це має бути список
Користуватись тільки зміною типів данних
# tuple set list

2) LIST
Написати топ 3 ул фільфа в списку
Потім видалити останній
Потім додати 2 нових в кінець
Змінити перший


3) Є 3 множини:
a = {1, 2, 3, 4, 5}
b = {6, 2, 8, 4, 9}
c = {6, 2, 12, 43, 29}
Треба:
* Від a відняти b і с і вивести результат
* Обьеднати всі 3 множини a b і с
* Вивести тільки ьі елементи які є оджночасно в a і b і c
"""
import time
from playsound import playsound

# Встановлення часу спрацьовування будильника
alarm_time = "10:00"  # Формат ГГ:ХХ
print(f"Будильник встановлено на {alarm_time}")

# Отримання поточного часу та перетворення його у формат ГГ:ХХ
current_time = time.strftime("%H:%M")
while current_time != alarm_time:
    print("Чекаю...")
    time.sleep(10)  # Чекати 10 секунд перед наступною перевіркою часу
    current_time = time.strftime("%H:%M")

# Відтворення звукового файлу, коли поточний час дорівнює часу будильника
print("Будильник!")
playsound('soundfile.mp3')  # Замініть 'path/to/your/soundfile.mp3' на шлях до вашого звукового файлу
