"""
Уявіть, що ви розробляєте програмне забезпечення для банківської системи. У системі є клас BankAccount,
який має методи для внесення та зняття коштів. Вам потрібно визначити власні класи виключень, які будуть
використовуватися для обробки типових проблем, що можуть виникнути під час цих операцій.

Задачі:

1) Створіть клас BankAccount з приватним атрибутом балансу, початковий баланс повинен бути нульовим.
2) Реалізуйте метод deposit(amount) для внесення коштів та withdraw(amount) для зняття коштів з рахунку.
3) Створіть власні виключення: NegativeDepositError при спробі внести від'ємну суму, InsufficientFundsError при спробі
   зняти суму, яка перевищує залишок на рахунку, та NegativeWithdrawalError при спробі зняти від'ємну суму.
4) Використовуйте ці виключення у ваших методах deposit та withdraw, викидаючи їх при виникненні відповідних ситуацій.
5) Напишіть код, який демонструє обробку цих виключень, використовуючи блоки try/except.

"""


