
# Базовий синтаксис

# Це коментар.
# Це означає, що Python дозволить вам писати примітки собі та іншим програмістам, які перевіряють ваш код
# І Python не запустить це взагалі або навіть не помітить.

# Символ # створює коментар.
# Ви можете мати коментар до рядка окремо

# Інструкція для друку є хорошим місцем для початку, вона дозволяє нам побачити результати відразу.

print("Або ви можете залишити коментар у цьому ж рядку")  # як команду, яку Python БУДЕ виконувати

print("Інструкція друку виведе деякий текст на екран.")

# Python виконуватиме команди зверху вниз, зліва направо

# Таким чином, оператор print у рядку 11 буде виконуватися перед оператором print у рядку 13

print("Ви можете використовувати багато нових рядків, щоб розділити інструкції")

print("Або ви можете тримати інструкції близько одне до одного.")
print("Це залежить від вас, але загалом вам потрібно зробити свій код максимально читабельним.")

# Ці два твердження ідентичні
print(4+4)
print(4 + 4)

# Рівні відступів tab та інші види пробілів мають велике значення

# Отже, якщо ви розкоментували наступний рядок і запустили це, ви отримаєте повідомлення про помилку.
#    print(4 + 4)
