
# Типи даних: int, float, bool, str

# У простій математиці та присвоєнні змінних ми побачили цілі і плаваючі значень.
# Ось швидке оновлення.

# int є цілими числами
print(5 + 2, 5 - 3, 5 * 5, 5 / 2)  # 7, 2, 25, 2

# floats є десятковими числами
print(5.4 + 2.1, 5.0 - 3, 5.7 * 5.2, 5 / 2.0)  # 7.5, 2.0, 29.64, 2.5

# логічні значення зберігати True або False (так чи ні)
print(5 > 4)  # True
print(3 + 3 <= 1)  # False

# Оператори порівняння
#   >    більш чим
#   <    менше ніж
#   >=   більше або дорівнює
#   <=   менше або дорівнює
#   !=   не дорівнює
#   ==   дорівнює

# string більш детально розглядаються в розділі 2
# Але, по суті, вони містять слова або взагалі все, що можна набрати на клавіатурі
print("Ці речі між лапками - рядки!")

print("Python зазвичай не дуже суворий щодо типів даних, але є деякі речі, які ви не можете робити.")
print("Цей рядок спричинить помилку, оскільки ви не можете додавати рядки до чисел. Це розділ № уроку" + 1)
