
# Проста математика

# Ми працюватимемо з операторами друку, щоб вивести результати на екран.

# Ви можете відокремити кілька елементів друку комою, як показано нижче:

print("Four times four is ", 4 * 4)

# додавання
print("5 + 3 is ", 5 + 3)

# віднімання
print("6 - 2 is ", 6 - 2)

# множення
print("10 * 20 is ", 10 * 20)

# ділення
print("55 / 2 is ", 55 / 2)  # Хм...!

print("За замовчуванням Python розглядає числа як int (цілі числа)")
print("Тож у певному сенсі відповідь Python 55/2 = 27 має сенс, навіть якщо це не зовсім те, що ми шукаємо.")
print("На щастя, є інші способи отримати потрібну відповідь.")

# Точне ділення (using floats)
print("55.0 / 2 is ", 55.0 / 2)
print("55 / 2.0 is ", 55 / 2.0)
print("55.0 / 2.0 is ", 55.0 / 2.0)

# Залишок від ділення
print("55 % 2 is ", 55 % 2)  # Це дуже корисно для визначення того, парне чи непарне число

# Степінь
print("2 ** 10 is ", 2 ** 10)
