
# Присвоєння змінної

# У Python (або будь-якій мові програмування) змінні містять інформацію,
# до якої ви можете отримати доступ, використовувати та змінювати

# У Python існує багато різних типів інформації, яку можна зберігати

# У деяких мовах ви завчасно вказуете, який тип інформації ви хочете зберігати,
# або навіть назву змінної, ще до того, як ви присвоете їй значення.
# Мені подобається Python, тому що він гнучкий і щадливий.


# Правила імен змінних
# -----------------------
# Змінні повинні починатися з букви або підкреслення
# Змінні можуть містити літери, цифри та підкреслення, але не пробіли
# Змінні не можуть бути названі так само, як вбудовані команди Python

# Якщо ви бачите саме по собі слово, яке не зарезервовано для Python, швидше за все, це змінна.

lesson_section = 1  # Загальні основи програмування
lesson_subsection = 2  # Призначення змінної

# У рядку вище я кажу Python, що хочу створити змінну під назвою 'lesson_section' і встановити її значення 1

# Правила Шеннона імен змінних
# ---------------------------------
# Змінні повинні бути описовими, навіть якщо це означає, що їх імена довгі
# Ви повинні мати можливість показати свій код будь-кому, і вони точно знатимуть, яку інформацію містить дана змінна
# Використовуйте підкреслення, щоб розбити слова!

# Ми зберегли значення всередині lesson_section і lesson_subsection, тому тепер давайте використовувати їх!

print("Ми знаходимося на секції #", lesson_section)
print("І це підсекція #", lesson_subsection, ", який охоплює призначення змінної")

print("Погляньте ще раз на код базових математичних операцій.")
print("Скрізь, де ви бачите число в цьому коді, ви можете замінити його змінною, яка містить число.")

# Давайте подивимося це на практиці:
days_in_a_year = 365  # Красиво описові назви змінних - це власні коментарі
my_age = 21  # Так, вірно!

print("Мій вік ", my_age, ", і я живу ", days_in_a_year * my_age, " днів.")

# Тепер давайте змінимо значення, що зберігається в days_in_a_year, щоб врахувати високосні роки, і спробуємо ще раз.

days_in_a_year = days_in_a_year + .25  # Еквівалент days_in_a_year = 365 + .25

print("Мій вік ", my_age, ", і я живу ", days_in_a_year * my_age, " днів, не додати не відняти.")
