# Цей код використовує штучний інтелект для розпізнавання об'єктів на зображенні з веб-камери

# Підключаємо потрібні інструменти (бібліотеки)
from keras.models import load_model  # Ця штука допомагає нам використовувати навчену модель штучного інтелекту
import cv2  # Це допомагає нам працювати з камерою і зображеннями
import numpy as np  # Це допомагає нам працювати з числами і масивами

# Налаштовуємо як виводити числа, щоб було зрозуміліше
np.set_printoptions(suppress=True)

# Завантажуємо навчену модель штучного інтелекту
model = load_model("keras_model.h5", compile=False)

# назви об'єктів, які наша модель вміє розпізнавати відповідають класс 1, класс 2, класс 3 по індексу
class_names = [
    "OK",
    "NOT OK",
    "OTHER"
]

# Вмикаємо камеру (0 - це зазвичай вбудована камера, 1 - зовнішня)
camera = cv2.VideoCapture(0)

# Запускаємо безкінечний цикл, щоб постійно отримувати зображення з камери
while True:
    # Отримуємо кадр (фотографію) з камери
    ret, image = camera.read()

    # Показуємо фотографію у вікні на екрані
    cv2.imshow("Video", image)

    # Змінюємо розмір фотографії, щоб вона підходила для нашої моделі
    image = cv2.resize(image, (224, 224), interpolation=cv2.INTER_AREA)

    # Перетворюємо фотографію у формат, який розуміє наша модель
    image = np.asarray(image, dtype=np.float32).reshape(1, 224, 224, 3)

    # Нормалізуємо значення пікселів (робимо їх в діапазоні від -1 до 1)
    image = (image / 127.5) - 1

    # Просимо модель розпізнати, що на фотографії
    prediction = model.predict(image)

    # Визначаємо, який об'єкт модель "побачила" з найбільшою впевненістю
    index = np.argmax(prediction)
    class_name = class_names[index]
    confidence_score = prediction[0][index]

    # Виводимо результат: що модель "побачила" і наскільки вона в цьому впевнена
    print("Об'єкт:", class_name)
    print("Впевненість:", confidence_score)

    # Перевіряємо, чи не натиснута клавіша на клавіатурі ESC
    keyboard_input = cv2.waitKey(1)

    # Якщо натиснута клавіша ESC (код 27), зупиняємо програму
    if keyboard_input == 27:
        break

# Вимикаємо камеру і закриваємо всі вікна
camera.release()
cv2.destroyAllWindows()
