# Ви також можете обробляти кілька типів винятків в одному блоці

# У наведеному нижче прикладі зміна віку в п'ятому рядку змінить поведінку програми.
# Якщо вік можна перетворити на int, рядок 13 буде виконуватися.
# Якщо вік – це рядок, але його не можна перетворити на int, виникне помилка ValueError
# Якщо вік - це інший тип речей (словник, список тощо),
#       a TypeError виникне, оскільки їх не можна перетворити на список

age = ''  # спробуйте зі 100, або з 'x100', або з ['100'], або з None, або з False, або з {'age': 100}

try:
    age = int(age)
except (TypeError, ValueError) as err:
    print("Invalid entry: {0}; error: {1}".format(age, err))
else:
    print("Your age is: {0}".format(age))
